app/controllers/comments_controller.rb

	def create
		@profile = Profile.find(params[:profile_id])
		@comment = @profile.comments.create(comment_params)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "profile_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "erin"], ["body", "yay yet"], ["profile_id", 1], ["created_at", "2018-11-21 23:10:12.554163"], ["updated_at", "2018-11-21 23:10:12.554163"]]

	def destroy
		@profile = Profile.find(params[:profile_id])
		@comment = @profile.comments.find(params[:id])
		@comment.destroy
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."profile_id" = ? AND "comments"."id" = ? LIMIT ?  [["profile_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]