app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@profile = Profile.find(params[:id])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@profile = Profile.find(params[:id])

INSERT INTO "profiles" ("flname", "subjects", "age", "phonenumber", "email", "experience", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create

		@profile = Profile.new(profile_params)


		if @profile.save

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "profiles" SET "updated_at" = ? WHERE "profiles"."id" = ?  [["updated_at", "2018-11-26 03:35:39.414208"], ["id", 8]]
---
	def update
		@profile = Profile.find(params[:id])

		if @profile.update(profile_params)

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 1]]
---
	def destroy
    	@profile = Profile.find(params[:id])
    	@profile.destroy